---
kind: method
id: M:Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Contains(Autodesk.Revit.DB.Electrical.WireConduitType)
source: html/5f6bc9f8-4893-b70b-51eb-f575d318bfc6.htm
---
# Autodesk.Revit.DB.Electrical.WireConduitTypeSet.Contains Method

Tests for the existence of a conduit type within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	WireConduitType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.WireConduitType`) - The conduit type to be searched for.

## Returns
The Contains method returns True if the conduit type is within the set, otherwise False.